# FilteredWorksetIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredWorksetIterator Class
Members See Also
---
An iterator to a set of worksets filtered by the settings of a FilteredWorksetCollector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class FilteredWorksetIterator : IEnumerator<Workset>
```

Visual Basic
---
```text
Public Class FilteredWorksetIterator _
	Implements IEnumerator(Of Workset)
```

Visual C++
---
```text
public ref class FilteredWorksetIterator : IEnumerator<Workset^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilteredWorksetIterator
# See Also
FilteredWorksetIterator Members
Autodesk.Revit.DB Namespace